Table of Contents
 Class Loading
Namespace
IdeaRS.OpenModel.Result
Assembly
IdeaRS.OpenModel.dll
Loading identification
[Obfuscation(Feature = "renaming")]
public class Loading
Inheritance
object
Loading
Derived
ResultOfLoading
Inherited Members
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Constructors
 Loading()
Constructor
public Loading()
 Loading(LoadingType, int)
Constructor
public Loading(LoadingType loadingType, int id)
Parameters
loadingType LoadingType
Type of loading
id int
Id of loading
Properties
 Id
Id of loading
public int Id { get; set; }
Property Value
int
 LoadingType
Type of loading
public LoadingType LoadingType { get; set; }
Property Value
LoadingType
 Edit this page